#### CreateDetailSection Method

---

|  |
| --- |
| AssemblyViewUtils Class   See Also |

# Overload List

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | CreateDetailSection(Document, ElementId, AssemblyDetailViewOrientation) | Creates a new detail section assembly view for the assembly instance. |
| Public method Static member | CreateDetailSection(Document, ElementId, AssemblyDetailViewOrientation, ElementId, Boolean) | Creates a new detail section assembly view for the assembly instance. |

# See Also

AssemblyViewUtils Class

AssemblyViewUtils Members

Autodesk.Revit.DB Namespace